Reports/СведенияОбОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СведенияОбОС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПостроительЗапроса</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>cfg:Filter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСведений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений "Работники организаций"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаБухгалтерскогоУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СчетаБухгалтерскогоУчетаОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаДооценокОС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/ГрафикиАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиАмортизацииОСБухгалтерскийУчет</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГрафикАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГодовыеГрафикиАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НачислениеАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НачислениеАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает когда начислять амортизацию по бух. учету</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыАмортизацииОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАмортизацииОСНалоговыйУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИспользованияДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НалоговыеНазначенияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НалоговыеНазначенияОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВыработкаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаОС</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/СведенияОбОС/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем ВысотаЗаголовка Экспорт;
Перем КодЯзыкаПечать;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

// Процедура перегружает значения отбора
// из реквизита обработки "Отбор"
// в отбор построителя запроса
// 
Процедура СкопироватьОтбор(ОтборИсточник, ОтборПриемник, ТолькоИспользуемые = Ложь) Экспорт
	
	// Очистка отбора приемника
	КвоЭлементов = ОтборПриемник.Количество() - 1;
	
	Для Н = 0 По КвоЭлементов Цикл
	
		ОтборПриемник.Удалить(КвоЭлементов - Н);	
	
	КонецЦикла;
	
	// Загрузка элементов отбора
	КвоЭлементов = ОтборИсточник.Количество() - 1;
	
	Для Н = 0 По КвоЭлементов Цикл
		
		ОбратныйИндекс = КвоЭлементов - Н;
		Элемент        = ОтборИсточник[ОбратныйИндекс];
		
		Если (НЕ ТолькоИспользуемые) ИЛИ Элемент.Использование Тогда
			
			Если ЗначениеЗаполнено(Элемент.ПутьКДанным) Тогда
				
				ЭлементПриемника = ОтборПриемник.Добавить(Элемент.ПутьКДанным);
				
			Иначе
				
				ЭлементПриемника = Неопределено;
				
			КонецЕсли;
			
			Если ЭлементПриемника <> Неопределено Тогда
				
				Попытка
				
					ЭлементПриемника.ВидСравнения  = Элемент.ВидСравнения;
					ЭлементПриемника.Значение	   = Элемент.Значение;
					ЭлементПриемника.ЗначениеС	   = Элемент.ЗначениеС;
					ЭлементПриемника.ЗначениеПо	   = Элемент.ЗначениеПо;
					ЭлементПриемника.Использование = Элемент.Использование;
					
				
				Исключение
					
					ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Элемент отбора <';uk='Елемент відбору <'", КодЯзыкаПечать) + Элемент + ">:" + Символы.ПС + Символы.Таб + ОписаниеОшибки()
					                 + Символы.ПС + Символы.Таб + НСтр("ru='Элемент удален.';uk='Елемент вилучений.'", КодЯзыкаПечать));
					
					ОтборПриемник.Удалить(ОтборПриемник.Индекс(ЭлементПриемника));
					ОтборИсточник.Удалить(ОбратныйИндекс);
					
				КонецПопытки;
				
			Иначе
				
				ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Элемент отбора <%1> не входит в число допустимых."
"	Элемент удален.';uk='Елемент відбору <%1> не входить до числа припустимих."
"	Елемент вилучено.'", КодЯзыкаПечать), Элемент));
				ОтборИсточник.Удалить(ОбратныйИндекс);
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры 

Функция СформироватьНадписьОтбора()
	
	ТекстОтбора = "";
	Разделитель = "";
	
	Для каждого ЭлементОтбора Из ПостроительЗапроса.Отбор Цикл
	
		Если ЭлементОтбора.Использование Тогда
			
			ТекстОтбора = ТекстОтбора + Разделитель + ЭлементОтбора;
			Разделитель = "; "
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ТекстОтбора) Тогда
		
		ТекстОтбора = НСтр("ru='Отбор не установлен';uk='Відбір не встановлений'", КодЯзыкаПечать);
		
	Иначе
		
		ТекстОтбора = НСтр("ru='Отбор: ';uk='Відбір: '", КодЯзыкаПечать) + ТекстОтбора;
		
	КонецЕсли;
	
	Возврат ТекстОтбора;

КонецФункции // СформироватьЗаголовокФормы()

Процедура СформироватьОтчет(ДокументРезультат, ТолькоЗаголовок = Ложь) Экспорт

	// Перегрузка значений из реквизита формы "Отбор"
	// в отбор построителя запроса
	СкопироватьОтбор(Отбор, ПостроительЗапроса.Отбор, Истина);
	
	ДокументРезультат.Очистить();
	
	Макет     = ПолучитьМакет("Макет");
	// 37490 <<
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	НаДату    = ?(НЕ ЗначениеЗаполнено(ДатаСведений), РабочаяДата, ДатаСведений);
	НаДату    = КонецДня(НаДату);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстОтбора  = СформироватьНадписьОтбора();
	ОбластьМакета.Параметры.ДатаСведений = НаДату;
	
	ДокументРезультат.Вывести(ОбластьМакета);
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
	
	Если ТолькоЗаголовок Тогда
		
		Возврат
		
	КонецЕсли;
	
	ПостроительЗапроса.Параметры.Вставить("ДатаСведений", НаДату + 1);
	
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда
		
		ОбластьНетДанных = Макет.ПолучитьОбласть("НетДанных");
		ДокументРезультат.Вывести(ОбластьНетДанных);
		Возврат;
		                                                                              
	КонецЕсли;
	
	Выборка           = ПостроительЗапроса.Результат.Выбрать();
	Разделитель        = Макет.ПолучитьОбласть("Разделитель");
	ВывестиРазделитель = Ложь;
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	
	Пока Выборка.Следующий() Цикл
		
		Если ВывестиРазделитель Тогда
			
			ДокументРезультат.Вывести(Разделитель, 1);
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Наименование");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(ОбластьМакета, 1);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПостоянныеСведения");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(ОбластьМакета, 2);
		
        // Управленческий учет
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаУпр");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ДокументРезультат.Вывести(ОбластьМакета, 1);
			
		ОбластьМакета = Макет.ПолучитьОбласть("УпрУчет");
		ОбластьМакета.Параметры.Заполнить(Выборка);
			
		ДокументРезультат.Вывести(ОбластьМакета, 2);
		
		// Регламентированный учет
		Если Выборка.Организация <> Null Тогда
			
			//ОбластьМакета = Макет.ПолучитьОбласть("ШапкаОсновныеСведения");
			//ОбластьМакета.Параметры.Заполнить(Выборка);
			//ДокументРезультат.Вывести(ОбластьМакета, 1);
			//
			//ОбластьМакета = Макет.ПолучитьОбласть("ОбщиеСведения");
			//ОбластьМакета.Параметры.Заполнить(Выборка);
			//
			//Если ЗначениеЗаполнено(Выборка.ОрганизацияНаименованиеПолное) Тогда
			//	
			//	ОбластьМакета.Параметры.ОрганизацияПредставление = Выборка.ОрганизацияНаименованиеПолное;
			//	
			//КонецЕсли;
			//
			//ДокументРезультат.Вывести(ОбластьМакета, 2);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаБух");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ДокументРезультат.Вывести(ОбластьМакета, 1);
			
			ОбластьМакета = Макет.ПолучитьОбласть("БухУчет");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			
			Если ЗначениеЗаполнено(Выборка.ОрганизацияНаименованиеПолное) Тогда
				
				ОбластьМакета.Параметры.ОрганизацияПредставление = Выборка.ОрганизацияНаименованиеПолное;
				
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьМакета, 2);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаНал");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ДокументРезультат.Вывести(ОбластьМакета, 1);
			
			ОбластьМакета = Макет.ПолучитьОбласть("НалУчет");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ДокументРезультат.Вывести(ОбластьМакета, 2);
			
		КонецЕсли;
		
		ВывестиРазделитель = Истина;
	
	КонецЦикла;
	
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	ДокументРезультат.ТолькоПросмотр                = Истина;
	ДокументРезультат.ВерхнийКолонтитул.Выводить    = Истина;
	ДокументРезультат.ВерхнийКолонтитул.ТекстСправа = НСтр("ru='Дата сведений: ';uk='Дата відомостей: '", КодЯзыкаПечать) + НаДату;
	ДокументРезультат.НижнийКолонтитул.Выводить     = Истина;
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1, 2, ДокументРезультат.ВысотаТаблицы,
	                                                                  ДокументРезультат.ШиринаТаблицы);
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияОбОС";
	
КонецПроцедуры // СформироватьОтчет()
                                                                                                    
// Процедура - заполняет начальные настройки заполнения
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительЗапроса                         = Новый ПостроительЗапроса;
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	|	ОсновныеСредства.Наименование КАК Наименование,
	|	ОсновныеСредства.Код КАК Код,
	|	ОсновныеСредства.НаименованиеПолное КАК НаименованиеПолное,
	|	ОсновныеСредства.Изготовитель КАК Изготовитель,
	|	ОсновныеСредства.НомерПаспорта КАК НомерПаспорта,
	|	ОсновныеСредства.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ОсновныеСредства.ДатаВыпуска КАК ДатаВыпуска,
	|	ОсновныеСредства.Модель КАК Модель,
	|	ОсновныеСредства.Автотранспорт КАК Автотранспорт,
	|	ОсновныеСредства.Комментарий КАК Комментарий,
	|	ПервоначальныеСведенияОСБУ.Организация КАК Организация,
	|	ПервоначальныеСведенияОСБУ.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСБУ.Организация) КАК ОрганизацияПредставление,
	|	МестонахождениеОС.МОЛ КАК МОЛ,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.МОЛ) КАК МОЛПредставление,
	|	МестонахождениеОС.Местонахождение КАК ПодразделениеОрганизации,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОС.Местонахождение) КАК ПодразделениеОрганизацииПредставление,
	|	ПервоначальныеСведенияОСБУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОСБУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимостьБУ,
	|	ПРЕДСТАВЛЕНИЕ(СчетаБухгалтерскогоУчетаОС.СчетУчета) КАК СчетУчетаБУ,
	|	ПРЕДСТАВЛЕНИЕ(СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации) КАК СчетНачисленияАмортизацииБУ,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСБУ.СпособНачисленияАмортизации) КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияОСБУ.ПараметрВыработки КАК ПараметрВыработки,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСБУ.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
	|	ГрафикиАмортизацииОС.ГрафикАмортизации КАК ГрафикАмортизации,
	|	ПРЕДСТАВЛЕНИЕ(ГрафикиАмортизацииОС.ГрафикАмортизации) КАК ГрафикАмортизацииПредставление,
	|	СпособыОтраженияРасходовПоАмортизацииБУ.СпособыОтраженияРасходовПоАмортизации КАК СпособОтраженияРасходовПоАмортизацииБУ,
	|	ПРЕДСТАВЛЕНИЕ(СпособыОтраженияРасходовПоАмортизацииБУ.СпособыОтраженияРасходовПоАмортизации) КАК СпособОтраженияРасходовПоАмортизацииБУПредставление,
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРабот КАК ОбъемПродукцииРабот,
	|	ПараметрыАмортизацииОСБУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБУ.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ХозрасчетныйСтоимость.СуммаОстаток КАК СтоимостьОстатокБУ,
	|	ХозрасчетныйАмортизация.СуммаОстатокКт КАК АмортизацияОстатокБУ,
	|	ВыработкаОС.КоличествоОборот КАК Выработка,
	|	ПервоначальныеСведенияОСНУ.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимостьНУ,
	|	НачислениеАмортизацииОСБУ.НачислятьАмортизацию КАК НачислятьАмортизациюБУ,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСНУ.НалоговаяГруппаОС) КАК НалоговаяГруппаОС,
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользования КАК СрокПолезногоИспользованияБУ,
	|	ПараметрыАмортизацииОСБУ.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьБУ,
	|	ПараметрыАмортизацииОСНУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииНУ,
	|	ПараметрыАмортизацииОСНУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииНУ,
	|	НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ПРЕДСТАВЛЕНИЕ(НалоговыеНазначенияОС.НалоговоеНазначение) КАК НалоговоеНазначениеПредставление,
	|	ХозрасчетныйСтоимость.СуммаНУОстаток КАК СтоимостьОстатокНУ,
	|	ХозрасчетныйАмортизация.СуммаНУОстатокКт КАК АмортизацияОстатокНУ,
	|	ВводВЭксплуатацию.ДатаСостояния КАК ДатаВводаВЭксплуатацию,
	|	ВводВЭксплуатацию.Регистратор КАК ДокументВводаВЭксплуатацию,
	|	ПРЕДСТАВЛЕНИЕ(ВводВЭксплуатацию.Регистратор) КАК ДокументВводаВЭксплуатациюПредставление,
	|	Выбытие.ДатаСостояния КАК ДатаВыбытия,
	|	Выбытие.Регистратор КАК ДокументВыбытия,
	|	ПРЕДСТАВЛЕНИЕ(Выбытие.Регистратор) КАК ДокументВыбытияПредставление,
	|	НалоговыеНазначенияОС.Регистратор КАК РегистраторВНД,
	|	ГрафикиАмортизацииОС.Регистратор КАК РегистраторГрафики,
	|	МестонахождениеОС.Регистратор КАК РегистраторМестонахождение,
	|	НачислениеАмортизацииОСБУ.Регистратор КАК РегистраторНачислениеАмортизацииБУ,
	|	ПараметрыАмортизацииОСБУ.Регистратор КАК РегистраторПараметрыАмортизации,
	|	ПараметрыАмортизацииОСНУ.Регистратор КАК РегистраторПараметрыАмортизацииНУ,
	|	ПервоначальныеСведенияОСБУ.Регистратор КАК РегистраторПервоначальныеСведенияБУ,
	|	ПервоначальныеСведенияОСНУ.Регистратор КАК РегистраторПервоначальныеСведенияНУ,
	|	СчетаБухгалтерскогоУчетаОС.Регистратор КАК РегистраторСчетаБУ,
	|	СпособыОтраженияРасходовПоАмортизацииБУ.Регистратор КАК РегистраторСпособов,
	|	МестонахождениеОСУУ.МОЛ КАК МОЛУУ,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОСУУ.МОЛ) КАК МОЛУУПредставление,
	|	МестонахождениеОСУУ.Местонахождение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(МестонахождениеОСУУ.Местонахождение) КАК ПодразделениеПредставление,
	|	ПервоначальныеСведенияОСУУ.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимостьУУ,
	|	ПервоначальныеСведенияОСУУ.ПараметрВыработки КАК ПараметрВыработкиУУ,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведенияОСУУ.ПараметрВыработки) КАК ПараметрВыработкиУУПредставление,
	|	ГрафикиАмортизацииОСУУ.ГрафикАмортизации КАК ГрафикАмортизацииУУ,
	|	ПРЕДСТАВЛЕНИЕ(ГрафикиАмортизацииОСУУ.ГрафикАмортизации) КАК ГрафикАмортизацииПредставлениеУУ,
	|	СпособыОтраженияРасходовПоАмортизацииУУ.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизацииУУ,
	|	ПРЕДСТАВЛЕНИЕ(СпособыОтраженияРасходовПоАмортизацииУУ.СпособыОтраженияРасходовПоАмортизации) КАК СпособыОтраженияРасходовПоАмортизацииУУПредставление,
	|	ПараметрыАмортизацииОСУУ.ОбъемПродукцииРабот КАК ОбъемПродукцииРаботУУ,
	|	ПараметрыАмортизацииОСУУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииУУ,
	|	ПараметрыАмортизацииОСУУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииУУ,
	|	ПараметрыАмортизацииОСУУ.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизацииУУ,
	|	СтоимостьОСУУ.СтоимостьОстаток КАК СтоимостьОстатокУУ,
	|	СтоимостьОСУУ.АмортизацияОстаток КАК АмортизацияОстатокУУ,
	|	ВыработкаОСУУ.КоличествоОборот КАК ВыработкаУУ,
	|	НачислениеАмортизацииОСУУ.НачислятьАмортизацию КАК НачислятьАмортизациюУУ,
	|	НачислениеАмортизацииОСУУ.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяцеУУ,
	|	ПараметрыАмортизацииОСУУ.СрокПолезногоИспользования КАК СрокПолезногоИспользованияУУ,
	|	ПараметрыАмортизацииОСУУ.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимостьУУ,
	|	ВыбытиеУУ.ДатаСостояния КАК ДатаВыбытияУУ,
	|	ВыбытиеУУ.Регистратор КАК ДокументВыбытияУУ,
	|	ПРЕДСТАВЛЕНИЕ(ВыбытиеУУ.Регистратор) КАК ДокументВыбытияУУПредставление,
	|	ГрафикиАмортизацииОСУУ.Регистратор КАК РегистраторГрафикиУУ,
	|	МестонахождениеОСУУ.Регистратор КАК РегистраторМестонахождениеУУ,
	|	НачислениеАмортизацииОСУУ.Регистратор КАК РегистраторНачислениеАмортизацииУУ,
	|	ПараметрыАмортизацииОСУУ.Регистратор КАК РегистраторПараметрыАмортизацииУУ,
	|	ПервоначальныеСведенияОСУУ.Регистратор КАК РегистраторПервоначальныеСведенияУУ,
	|	СпособыОтраженияРасходовПоАмортизацииУУ.Регистратор КАК РегистраторСпособовУУ,
	|	ПервоначальныеСведенияОСУУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизацииУУ,
	|	ВводВЭксплуатациюУУ.ДатаСостояния КАК ДатаВводаВЭксплуатациюУУ,
	|	ВводВЭксплуатациюУУ.Регистратор КАК ДокументВводаВЭксплуатациюУУ,
	|	ПРЕДСТАВЛЕНИЕ(ВводВЭксплуатациюУУ.Регистратор) КАК ДокументВводаВЭксплуатациюУУПредставление
	|{ВЫБРАТЬ
	|	ОсновноеСредство,
	|	Наименование,
	|	Код,
	|	НаименованиеПолное,
	|	Изготовитель,
	|	НомерПаспорта,
	|	ЗаводскойНомер,
	|	ДатаВыпуска,
	|	Модель,
	|	Автотранспорт,
	|	Комментарий,
	|	Организация,
	|	ОрганизацияНаименованиеПолное,
	|	МОЛ,
	|	ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ИнвентарныйНомер,
	|	ПервоначальнаяСтоимостьБУ,
	|	СчетУчетаБУ,
	|	СчетНачисленияАмортизацииБУ,
	|	СпособНачисленияАмортизации,
	|	ПараметрВыработки,
	|	ГрафикАмортизации,
	|	СпособОтраженияРасходовПоАмортизацииБУ,
	|	ОбъемПродукцииРабот,
	|	СрокИспользованияДляВычисленияАмортизации,
	|	СтоимостьДляВычисленияАмортизации,
	|	ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	СтоимостьОстатокБУ,
	|	АмортизацияОстатокБУ,
	|	Выработка,
	|	ПервоначальнаяСтоимостьНУ,
	|	НачислятьАмортизациюБУ,
	|	НалоговаяГруппаОС,
	|	СрокПолезногоИспользованияБУ,
	|	ЛиквидационнаяСтоимостьБУ,
	|	СрокИспользованияДляВычисленияАмортизацииНУ,
	|	СтоимостьДляВычисленияАмортизацииНУ,
	|	НалоговоеНазначение,
	|	СтоимостьОстатокНУ,
	|	АмортизацияОстатокНУ,
	|	ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ДокументВводаВЭксплуатацию,
	|	ДатаВыбытия,
	|	ДокументВыбытия,
	|	РегистраторВНД,
	|	РегистраторГрафики,
	|	РегистраторМестонахождение,
	|	РегистраторНачислениеАмортизацииБУ,
	|	РегистраторПараметрыАмортизации,
	|	РегистраторПараметрыАмортизацииНУ,
	|	РегистраторПервоначальныеСведенияБУ,
	|	РегистраторПервоначальныеСведенияНУ,
	|	РегистраторСчетаБУ,
	|	РегистраторСпособов,
	|	МОЛУУ,
	|	Подразделение,
	|	ПервоначальнаяСтоимостьУУ,
	|	ПараметрВыработкиУУ,
	|	ГрафикАмортизацииУУ,
	|	СпособыОтраженияРасходовПоАмортизацииУУ,
	|	ОбъемПродукцииРаботУУ,
	|	СрокИспользованияДляВычисленияАмортизацииУУ,
	|	СтоимостьДляВычисленияАмортизацииУУ,
	|	ОбъемПродукцииРаботДляВычисленияАмортизацииУУ,
	|	СтоимостьОстатокУУ,
	|	АмортизацияОстатокУУ,
	|	ВыработкаУУ,
	|	НачислятьАмортизациюУУ,
	|	НачислятьАмортизациюВТекущемМесяцеУУ,
	|	СрокПолезногоИспользованияУУ,
	|	ЛиквидационнаяСтоимостьУУ,
	|	ДатаВыбытияУУ,
	|	ДокументВыбытияУУ,
	|	РегистраторГрафикиУУ,
	|	РегистраторМестонахождениеУУ,
	|	РегистраторНачислениеАмортизацииУУ,
	|	РегистраторПараметрыАмортизацииУУ,
	|	РегистраторПервоначальныеСведенияУУ,
	|	РегистраторСпособовУУ,
	|	СпособНачисленияАмортизацииУУ КАК СпособНачисленияАмортизацииУУ,
	|	ДатаВводаВЭксплуатациюУУ,
	|	ДокументВводаВЭксплуатациюУУ}
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ПервоначальныеСведенияОСБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК МестонахождениеОС
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = МестонахождениеОС.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК СчетаБухгалтерскогоУчетаОС
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		&ДатаСведений,
	|		Счет В
	|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        СчетаБухгалтерскогоУчетаОС.СчетУчета
	|		    ИЗ
	|		        РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаСведений, ) КАК СчетаБухгалтерскогоУчетаОС),
	|		&СубконтоОС,
	|		{ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ХозрасчетныйСтоимость
	|				ПО СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = ХозрасчетныйСтоимость.Субконто1
	|					И СчетаБухгалтерскогоУчетаОС.Организация = ХозрасчетныйСтоимость.Организация
	|					И СчетаБухгалтерскогоУчетаОС.СчетУчета = ХозрасчетныйСтоимость.Счет
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	|		&ДатаСведений,
	|		Счет В
	|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации
	|		    ИЗ
	|		        РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ДатаСведений, ) КАК СчетаБухгалтерскогоУчетаОС),
	|		&СубконтоОС,
	|		{ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ХозрасчетныйАмортизация
	|				ПО СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = ХозрасчетныйАмортизация.Субконто1
	|					И СчетаБухгалтерскогоУчетаОС.Организация = ХозрасчетныйАмортизация.Организация
	|					И СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации = ХозрасчетныйАмортизация.Счет
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = СчетаБухгалтерскогоУчетаОС.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ГрафикиАмортизацииОС
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ГрафикиАмортизацииОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = ГрафикиАмортизацииОС.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК НачислениеАмортизацииОСБУ
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = НачислениеАмортизацииОСБУ.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = НачислениеАмортизацииОСБУ.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ 
	|				РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ПараметрыАмортизацииОСНУ
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ПараметрыАмортизацииОСНУ.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = ПараметрыАмортизацииОСНУ.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ПараметрыАмортизацииОСБУ
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ПараметрыАмортизацииОСБУ.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = ПараметрыАмортизацииОСБУ.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК НалоговыеНазначенияОС
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = НалоговыеНазначенияОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = НалоговыеНазначенияОС.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК ВводВЭксплуатацию
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ВводВЭксплуатацию.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = ВводВЭксплуатацию.Организация
	|				И (ВводВЭксплуатацию.Состояние = &СостояниеВвода)
	|				И (ВводВЭксплуатацию.ДатаСостояния <= &ДатаСведений)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК Выбытие
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = Выбытие.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = Выбытие.Организация
	|				И (Выбытие.Состояние = &СостояниеВыбытия)
	|				И (Выбытие.ДатаСостояния <= &ДатаСведений)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаОС.Обороты(, &ДатаСведений, , {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ВыработкаОС
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = ВыработкаОС.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.ПараметрВыработки = ВыработкаОС.ПараметрВыработки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК СпособыОтраженияРасходовПоАмортизацииБУ
	|			ПО ПервоначальныеСведенияОСБУ.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииБУ.ОсновноеСредство
	|				И ПервоначальныеСведенияОСБУ.Организация = СпособыОтраженияРасходовПоАмортизацииБУ.Организация
	|		ПО ОсновныеСредства.Ссылка = ПервоначальныеСведенияОСБУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство, Организация.* КАК Организация}) КАК ПервоначальныеСведенияОСНУ
	|		ПО ОсновныеСредства.Ссылка = ПервоначальныеСведенияОСНУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ПервоначальныеСведенияОСУУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК МестонахождениеОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = МестонахождениеОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиАмортизацииОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ГрафикиАмортизацииОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ГрафикиАмортизацииОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОС КАК ВыбытиеУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ВыбытиеУУ.ОсновноеСредство
	|				И (ВыбытиеУУ.Состояние = &СостояниеВыбытия)
	|				И (ВыбытиеУУ.ДатаСостояния <= &ДатаСведений)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаОС.Обороты(, &ДатаСведений, , {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ВыработкаОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ВыработкаОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СпособыОтраженияРасходовПоАмортизацииУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС.Остатки(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СтоимостьОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = СтоимостьОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОС КАК ВводВЭксплуатациюУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ВводВЭксплуатациюУУ.ОсновноеСредство
	|				И (ВводВЭксплуатациюУУ.Состояние = &СостояниеВвода)
	|				И (ВводВЭксплуатациюУУ.ДатаСостояния <= &ДатаСведений)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК НачислениеАмортизацииОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = НачислениеАмортизацииОСУУ.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОС.СрезПоследних(&ДатаСведений, {ОсновноеСредство.* КАК ОсновноеСредство}) КАК ПараметрыАмортизацииОСУУ
	|			ПО ПервоначальныеСведенияОСУУ.ОсновноеСредство = ПараметрыАмортизацииОСУУ.ОсновноеСредство
	|		ПО ОсновныеСредства.Ссылка = ПервоначальныеСведенияОСУУ.ОсновноеСредство
	|ГДЕ
	|	(НЕ ОсновныеСредства.ЭтоГруппа)
	|{ГДЕ
	|	ОсновныеСредства.Ссылка.* КАК ОсновноеСредство,
	|	ПервоначальныеСведенияОСБУ.Организация.* КАК Организация,
	|	МестонахождениеОС.МОЛ.* КАК МОЛ,
	|	МестонахождениеОС.Местонахождение.* КАК ПодразделениеОрганизации,
	|	ПервоначальныеСведенияОСБУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОСБУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	СпособыОтраженияРасходовПоАмортизацииБУ.СпособыОтраженияРасходовПоАмортизации КАК СпособОтраженияРасходовПоАмортизацииБУ,
	|	ПервоначальныеСведенияОСБУ.ПараметрВыработки.* КАК ПараметрВыработки,
	|	ГрафикиАмортизацииОС.ГрафикАмортизации.* КАК ГрафикАмортизации,
	|	НачислениеАмортизацииОСБУ.НачислятьАмортизацию КАК НачислятьАмортизациюБУ,
	|	ПараметрыАмортизацииОСБУ.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначение,
	|	МестонахождениеОСУУ.МОЛ.* КАК МОЛУУ,
	|	МестонахождениеОСУУ.Местонахождение.* КАК Подразделение,
	|	СпособыОтраженияРасходовПоАмортизацииУУ.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизацииУУ,
	|	ГрафикиАмортизацииОСУУ.ГрафикАмортизации.* КАК ГрафикАмортизацииУУ,
	|	ПервоначальныеСведенияОСУУ.ПараметрВыработки.*,
	|	ПараметрыАмортизацииОСУУ.СрокПолезногоИспользования КАК СрокПолезногоИспользованияУУ,
	|	ПервоначальныеСведенияОСУУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизацииУУ,
	|	НачислениеАмортизацииОСУУ.НачислятьАмортизацию КАК НачислятьАмортизациюУУ}
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Параметры = ПостроительЗапроса.Параметры;
	
	
	Параметры.Вставить("СубконтоОС"                , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Параметры.Вставить("СостояниеВвода"            , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	Параметры.Вставить("СостояниеВыбытия"          , Перечисления.СостоянияОС.СнятоСУчета);

	ДоступныеПоля = ПостроительЗапроса.ДоступныеПоля;
	
	// Заполнение пользовательских представлений для доступных полей
	СтруктураПредставлениеПолей = Новый Структура;
	
	СтруктураПредставлениеПолей.Вставить("Организация"							 	, НСтр("ru='Организация';uk='Організація'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("Подразделение"						 	, НСтр("ru='Подразделение';uk='Підрозділ'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("МОЛ"							 		 	, НСтр("ru='МОЛ';uk='МВО'", КодЯзыкаПечать));
	
	СтруктураПредставлениеПолей.Вставить("ОсновноеСредство"                      	, НСтр("ru='Основное средство';uk='Основний засіб'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("ИнвентарныйНомер"                      	, НСтр("ru='Инвентарный номер';uk='Інвентарний номер'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("СпособНачисленияАмортизации"           	, НСтр("ru='Способ начисления амортизации';uk='Спосіб нарахування амортизації'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("ПараметрВыработки"                     	, НСтр("ru='Параметр выработки';uk='Параметр виробітку'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("ГрафикАмортизации"                     	, НСтр("ru='График амортизации';uk='Графік амортизації'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("НачислятьАмортизациюБУ"                	, НСтр("ru='Начислять амортизацию (БУ)';uk='Нараховувати амортизацію (БО)'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("СрокПолезногоИспользования"            	, НСтр("ru='Срок полезного использования';uk='Строк корисного використання'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("СрокИспользованияДляВычисленияАмортизации", НСтр("ru='Срок использования для вычисления амортизации, мес.';uk='Строк використання для обчислення амортизації, міс.'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("НалоговоеНазначение"                   	, НСтр("ru='Налоговое назначение';uk='Податкове призначення'", КодЯзыкаПечать));
	СтруктураПредставлениеПолей.Вставить("СпособОтраженияРасходовПоАмортизацииБУ"	, НСтр("ru='Способ отражения расходов по амортизации';uk='Спосіб відображення витрат по амортизації'", КодЯзыкаПечать));
	
	Для каждого КлючЗначение Из СтруктураПредставлениеПолей Цикл
		
		Поле = ДоступныеПоля.Найти(КлючЗначение.Ключ);
		
		Если Поле <> Неопределено  Тогда
			
			Поле.Представление = КлючЗначение.Значение;			
			
		КонецЕсли;		
	
	КонецЦикла;
	
	// заполнение доступных полей для реквизита обработки
	Отбор.УстановитьДоступныеПоля(ДоступныеПоля);
	
	// поля по умолчанию                                                                
	Отбор.Добавить("ОсновноеСредство");
	Отбор.Добавить("Организация");
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();

#КонецЕсли
